app/controllers/points_controller.rb

  def index
    @points = Point.all
---
SELECT * FROM `points`

  def show
    @point = Point.find(params[:id])
---
SELECT * FROM `points` WHERE (`points`.`id` = 1)

  def edit
    @point = Point.find(params[:id])
---
SELECT * FROM `points` WHERE (`points`.`id` = 1)

  def create
    @point = Point.new(params[:point])

    respond_to do |format|
      if @point.save
---
INSERT INTO `points` (`position`, `created_at`, `updated_at`, `points`) VALUES(NULL, '2009-10-04 22:06:15', '2009-10-04 22:06:15', NULL)

  def update
    @point = Point.find(params[:id])

    respond_to do |format|
      if @point.update_attributes(params[:point])
---
SELECT * FROM `points` WHERE (`points`.`id` = 1)
UPDATE `points` SET `updated_at` = '2009-10-04 22:08:46', `position` = 1, `points` = 185 WHERE `id` = 1